# Задача 32: Определить элементs массива (списка), значения которых принадлежат заданному
# диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 1
# 19
# Вывод: [1, 9, 13, 14, 19]


#list1 = [int(input()) for i in range(int(input()))]
list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_val = int(input('Введите число начала диапазона: '))
max_val = int(input('Введите число конца диапазона: '))
list_res = [i for i in list1 if min_val <= i <= max_val]
print(sorted(list_res))