# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15
# 

def arprog(a1, d, n):
    list1 = list()
    list1.append(a1)
    for i in range(1, n):
       list1.append(list1[i-1] + d)
    return list1

a1 = int(input('Введите первый элемент прогрессии: '))
d = int(input('Введите разность: '))
n = int(input('Введите количество элементов: '))
print(arprog(a1, d, n))


