# Задача 2: Найдите сумму цифр трехзначного числа.

i = int(input('i = '))
j = (i//100) + (i % 100//10) + (i % 100%10)
print("Сумма цифр", i, " = ",j)