# за день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной в m км
# n = int(input())
# print(1, end ' ')
# print(5)

# n = 700
# m = 750

# print((m + n - 1) // n)
# // целая часть от деления
# / деление с остатком
# % остаток от деления

# В некоторой школе  решили набрать 3 новых математических класса 
# и оборудовать кабинеты для них новыми партами. 
# За каждой партой может сидеть 2 учащихся. Известно количесство учащихся в каждом из 3 классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них

# 20
# 21
# 22

# 32

# a = 20
# b = 21
# c = 22
# a1 = ((a + 1)//2)
# b1 = ((b + 1)//2)
# c1 = ((c + 1)//2)    
# print(a1 + b1 + c1)

# 5. Вагоны в электричке пронумерованы натуральными числами, начиная с 1 
# (при этом иногда вагоны нумеруются от «головы» поезда, а иногда – с «хвоста»; 
# это зависит от того, в какую сторону едет электричка). В каждом вагоне написан
# его номер. Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j.
# Он хочет определить, сколько всего вагонов в электричке. Напишите программу, которая будет 
# это делать или сообщать, что без дополнительной информации это сделать невозможно.

# **Input:**
# 3
# 4

# **Output:**
# 6

# i = int(input('i = '))
# j = int(input('j5 = '))
# if i == j:
#     print("Мало данных")
# print((j + i) - 1)

# определить високосный ли год 

# i = int(input('i = '))
# if (i % 4 == 0 and i % 100 != 0) or (i % 400 == 0):
#     print("Yes")
# else: 
#     print("No")