# Задача 12: Петя и Катя – брат и сестра. 
# Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2

sum = int(input())
prod = int(input())

dis = sum**2 - 4 * prod
from math import sqrt
x = (sum + sqrt(dis))/2
y = (sum - sqrt(dis))/2

print(int(x))
print(int(y))
